In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [4]:
df=pd.DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],'data1':np.arange(5),'data2':np.arange(5,10)})
df

  key1 key2  data1  data2
0    a  one      0      5
1    a  two      1      6
2    b  one      2      7
3    b  two      3      8
4    a  one      4      9

In [6]:
grouped=df['data1'].groupby(df['key1'])
grouped.mean()

key1
a    1.666667
b    2.500000
Name: data1, dtype: float64

In [8]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one     2.0
      two     1.0
b     one     2.0
      two     3.0
Name: data1, dtype: float64

In [9]:
means.unstack()

key2  one  two
key1
a     2.0  1.0
b     2.0  3.0

In [10]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])
years=np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()

California  2005    1.0
            2006    2.0
Ohio        2005    1.5
            2006    4.0
Name: data1, dtype: float64

In [11]:
df.groupby('key1').mean()

/var/folders/6l/0rnqwtgd2lqfvr4vcry4xjrc0000gn/T/ipykernel_62354/2057825055.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('key1').mean()

         data1     data2
key1
a     1.666667  6.666667
b     2.500000  7.500000

In [12]:
df.groupby(['key1','key2']).mean()

           data1  data2
key1 key2
a    one     2.0    7.0
     two     1.0    6.0
b    one     2.0    7.0
     two     3.0    8.0

In [13]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [14]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2  data1  data2
0    a  one      0      5
1    a  two      1      6
4    a  one      4      9
b
  key1 key2  data1  data2
2    b  one      2      7
3    b  two      3      8

In [15]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2  data1  data2
0    a  one      0      5
4    a  one      4      9
('a', 'two')
  key1 key2  data1  data2
1    a  two      1      6
('b', 'one')
  key1 key2  data1  data2
2    b  one      2      7
('b', 'two')
  key1 key2  data1  data2
3    b  two      3      8

In [16]:
pieces=dict(list(df.groupby('key1')))
pieces['b']

  key1 key2  data1  data2
2    b  one      2      7
3    b  two      3      8

In [17]:
pieces['a']

  key1 key2  data1  data2
0    a  one      0      5
1    a  two      1      6
4    a  one      4      9

In [18]:
pieces=dict(list(df.groupby(['key1','key2'])))
pieces[('b','one')]

  key1 key2  data1  data2
2    b  one      2      7

In [19]:
df.dtypes

key1     object
key2     object
data1     int64
data2     int64
dtype: object

In [20]:
for dtype,group in df.groupby(df.dtypes,axis=1):
    print(dtype)
    print(group)

int64
   data1  data2
0      0      5
1      1      6
2      2      7
3      3      8
4      4      9
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [22]:
df.groupby('key1')['data1'].mean()

key1
a    1.666667
b    2.500000
Name: data1, dtype: float64

In [23]:
s_grouped=df.groupby(['key1','key2'])['data2']
s_grouped.mean()

key1  key2
a     one     7.0
      two     6.0
b     one     7.0
      two     8.0
Name: data2, dtype: float64

In [24]:
df

  key1 key2  data1  data2
0    a  one      0      5
1    a  two      1      6
2    b  one      2      7
3    b  two      3      8
4    a  one      4      9

In [29]:
people=pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])
people.iloc[2:3,[1,2]]=np.nan
people

               a         b         c         d         e
Joe     0.051409 -1.060301  1.517890  0.510494 -0.652120
Steve   0.551007 -0.204305  0.177105  0.182818  0.786435
Wes    -0.143728       NaN       NaN -0.242618  0.147719
Jim    -0.347675  0.144373 -0.100088  1.363647 -0.552095
Travis  0.589771 -0.727029  0.771883 -1.217304 -0.792042

In [34]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}
by_column=people.groupby(mapping,axis=1)
by_column.sum()

            blue       red
Joe     2.028384 -1.661011
Steve   0.359923  1.133138
Wes    -0.242618  0.003992
Jim     1.263559 -0.755396
Travis -0.445422 -0.929300

In [37]:
mapping={'a':'red','b':'orange','c':'blue','d':'blue','e':'red','f':'orange'}
by_column=people.groupby(mapping,axis=1)
by_column.sum()

            blue    orange       red
Joe     2.028384 -1.060301 -0.600711
Steve   0.359923 -0.204305  1.337443
Wes    -0.242618  0.000000  0.003992
Jim     1.263559  0.144373 -0.899770
Travis -0.445422 -0.727029 -0.202271

In [38]:
map_series=pd.Series(mapping)
map_series

a       red
b    orange
c      blue
d      blue
e       red
f    orange
dtype: object

In [39]:
people.groupby(map_series,axis=1).count()

        blue  orange  red
Joe        2       1    2
Steve      2       1    2
Wes        1       0    2
Jim        2       1    2
Travis     2       1    2

In [41]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.439994 -0.915927  1.417803  1.631523 -1.056495
5  0.551007 -0.204305  0.177105  0.182818  0.786435
6  0.589771 -0.727029  0.771883 -1.217304 -0.792042

In [42]:
key_list=['one','one','one','two','two']
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.143728 -1.060301  1.517890 -0.242618 -0.652120
  two -0.347675  0.144373 -0.100088  1.363647 -0.552095
5 one  0.551007 -0.204305  0.177105  0.182818  0.786435
6 two  0.589771 -0.727029  0.771883 -1.217304 -0.792042

In [43]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['cty','tenor'])
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      2.015519  0.509874 -0.058343  0.975804  0.161963
1      1.378487  0.301077  0.225023  0.216013  0.855991
2     -0.644992 -1.422081 -0.397968  0.494701 -1.900100
3      0.336456 -0.549185 -0.145260 -0.375756  0.052424

In [44]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [45]:
df

  key1 key2  data1  data2
0    a  one      0      5
1    a  two      1      6
2    b  one      2      7
3    b  two      3      8
4    a  one      4      9

In [46]:
grouped=df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    3.4
b    2.9
Name: data1, dtype: float64

In [53]:
def peak_to_peak(arr):
    return arr.max()-arr.min()
grouped.agg(peak_to_peak)

/var/folders/6l/0rnqwtgd2lqfvr4vcry4xjrc0000gn/T/ipykernel_62354/870989620.py:3: FutureWarning: ['key2'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg(peak_to_peak)

      data1  data2
key1
a         4      4
b         1      1

In [54]:
grouped.describe()

     data1                                                data2            \
     count      mean       std  min   25%  50%   75%  max count      mean
key1
a      3.0  1.666667  2.081666  0.0  0.50  1.0  2.50  4.0   3.0  6.666667
b      2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0   2.0  7.500000


           std  min   25%  50%   75%  max
key1
a     2.081666  5.0  5.50  6.0  7.50  9.0
b     0.707107  7.0  7.25  7.5  7.75  8.0

In [56]:
frame=pd.DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})
quartiels=pd.cut(frame.data1,4)
quartiels[:10]

0     (0.0486, 1.829]
1    (-1.732, 0.0486]
2    (-1.732, 0.0486]
3     (0.0486, 1.829]
4     (0.0486, 1.829]
5    (-1.732, 0.0486]
6     (0.0486, 1.829]
7    (-1.732, 0.0486]
8     (0.0486, 1.829]
9       (1.829, 3.61]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.52, -1.732] < (-1.732, 0.0486] < (0.0486, 1.829] < (1.829, 3.61]]

In [57]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}
grouped=frame.data2.groupby(quartiels)
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.52, -1.732]  -2.629974  2.501510   38.0 -0.114220
(-1.732, 0.0486] -2.877145  3.989277  492.0 -0.010097
(0.0486, 1.829]  -2.521977  3.063300  436.0  0.050808
(1.829, 3.61]    -1.952021  1.720036   34.0  0.175317

In [58]:
grouping=pd.qcut(frame.data1,10,labels=False)
grouped=frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.629974  2.501510  100.0  0.028328
1     -2.877145  2.571754  100.0 -0.072283
2     -2.734725  2.690362  100.0 -0.086568
3     -2.297646  3.989277  100.0 -0.068259
4     -2.683289  2.202313  100.0 -0.001309
5     -2.307544  2.484803  100.0  0.190080
6     -2.011279  2.795031  100.0  0.102819
7     -2.463822  3.063300  100.0  0.066432
8     -2.213804  2.602264  100.0  0.025623
9     -2.521977  2.135573  100.0  0.003190

In [59]:
s=pd.Series(np.random.randn(6))
s[::2]=np.nan
s

0         NaN
1    0.480345
2         NaN
3    0.609136
4         NaN
5   -1.954717
dtype: float64

In [60]:
states=['Ohio','New York','Vermont','Florida','Oregon','Nevada','California','Idaho']
group_key=['East']*4+['West']*4
data=pd.Series(np.random.randn(8),index=states)
data

Ohio         -0.432391
New York      1.113959
Vermont       1.559201
Florida      -1.677643
Oregon       -0.308187
Nevada        0.706349
California   -0.831976
Idaho         0.301939
dtype: float64

In [61]:
data[['Vermont','Nevada','Idaho']]=np.nan
data

Ohio         -0.432391
New York      1.113959
Vermont            NaN
Florida      -1.677643
Oregon       -0.308187
Nevada             NaN
California   -0.831976
Idaho              NaN
dtype: float64

In [62]:
data.groupby(group_key).mean()

East   -0.332025
West   -0.570082
dtype: float64

In [63]:
fill_values={'East':0.5,'West':-1}
fill_func=lambda g:g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

/var/folders/6l/0rnqwtgd2lqfvr4vcry4xjrc0000gn/T/ipykernel_62354/3875476562.py:3: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  data.groupby(group_key).apply(fill_func)

Ohio         -0.432391
New York      1.113959
Vermont       0.500000
Florida      -1.677643
Oregon       -0.308187
Nevada       -1.000000
California   -0.831976
Idaho        -1.000000
dtype: float64

In [73]:
suits=['H','S','C','D']
card_val=(list(range(1,11))+[10]*3)*4
base_names=['A']+list(range(2,11))+['J','K','Q']
cards=[]
for suit in suits:
    cards.extend(str(num)+suit for num in base_names)
deck=pd.Series(card_val,index=cards)
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [71]:
def draw(deck,n=5):
    return deck.sample(n)
draw(deck)

9D      9
7C      7
10S    10
5D      5
3D      3
dtype: int64

In [74]:
get_suit=lambda card:card[-1]
deck.groupby(get_suit).apply(draw,n=2)

C  8C     8
   JC    10
D  9D     9
   4D     4
H  2H     2
   5H     5
S  5S     5
   6S     6
dtype: int64

In [75]:
deck.groupby(get_suit,group_keys=False).apply(draw,n=2)

9C     9
JC    10
6D     6
KD    10
5H     5
4H     4
JS    10
7S     7
dtype: int64

In [76]:
df=pd.DataFrame({'category':['a','a','a','a','b','b','b','b'],'data':np.random.randn(8),'weights':np.random.randn(8)})
df

  category      data   weights
0        a  0.932086 -2.177220
1        a -2.133907 -0.921928
2        a  0.118146 -1.028743
3        a -0.957657  2.335802
4        b -0.487907  0.870786
5        b  0.926420 -0.961401
6        b  0.904669  0.356725
7        b -1.257378  0.530502

In [77]:
grouped=df.groupby('category')
get_wavg=lambda g:np.average(g['data'],weights=g['weights'])
grouped.apply(get_wavg)

category
a    1.350650
b   -2.083633
dtype: float64

In [82]:
np.average([1,2,3,4],weights=[0.1,0.2,0.3,0.4])==1*0.1+2*0.2+3*0.3+4*0.4

True

In [83]:
data=pd.DataFrame(np.arange(5*4).reshape(5,4))
data

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19